{
  "home": {
    "hello": "Hello, i'm",
    "myPost": "I'm a full-stack web developer. Certified Vue.js",
    "viewCertif": "View my certification"
  },
  "header": {
    "home": "home",
    "about": "about me",
    "formation": "formation",
    "experiences": "experiences",
    "projects": "projects",
    "references": "references"
  },
  "aboutSection": {
    "title": "About me",
    "subtitle": "Here you will find more information about me, what I do, and my current skills mostly in terms of programming and technology",
    "descriptionTitle": "Get to know me !",
    "description1": "I am a passionate <b>full-stack developer</b>, specialized in <b>Laravel</b> and <b>Vue.js</b> technologies.",
    "description2": "My journey in the world of development began <b>more than %{experience} years ago</b>, and since then, I have had the opportunity to work on a variety of projects, ranging from complex web applications to stylish websites. My love for programming has led me to constantly explore new technologies and seek innovative solutions to solve problems.",
    "description3": "Apart from coding, I also enjoy <b>music</b>, <b>sport</b> and <b>discovering new cultures</b>.",
    "description4": "I am convinced that technology can improve our daily lives, and I am always enthusiastic about participating in projects that make a difference in the digital world.",
    "skillsTitle": "My skills",
    "languages": "languages",
    "versioning": "versioning",
    "others": "others"
  },
  "formationSection": {
    "title": "formation",
    "formation1": {
      "establishment": "High School April 9, 1938 of Sfax - Tunisia",
      "degree": "High school",
      "degreeDetails": "Mathematics Bachelor"
    },
    "formation2": {
      "establishment": "Faculty of Sciences of Sfax - Tunisia",
      "degree": "Licence",
      "degreeDetails": "Fundamental license in computer science"
    },
    "formation3": {
      "establishment": "Riga Technical University - Latvia",
      "degree": "ERASMUS+",
      "degreeDetails": "ERASMUS+ student exchange program"
    },
    "formation4": {
      "establishment": "Higher Institute of Computer Science and Multimedia of Sfax - Tunisia",
      "degree": "Engineering",
      "degreeDetails": "National engineering diploma in computer science, web and multimedia technologies"
    }
  },
  "experiencesSection": {
    "title": "experiences",
    "technologyAndEnv": "Technology/Environment",
    "experiences1": {
      "post": "Full Stack PHP & Javascript web developer",
      "mission1": "Constant technological surveillance.",
      "mission2": "Collaboration to create attractive and user-friendly user interfaces.",
      "mission3": "Integration of models",
      "mission4": "Front-End and Back-End design and development for web applications.",
      "mission5": "Development of essential features and custom modules.",
      "mission6": "Integration of third-party services.",
      "mission7": "Implementation of unit tests.",
      "mission8": "Evolutionary and corrective maintenance.",
      "mission9": "Active participation in team meetings and project planning."
    },
    "experiences2": {
      "post": "Full Stack Laravel & Vue.js web developer",
      "mission1": "Collaboration to create attractive and user-friendly user interfaces.",
      "mission2": "Integration of models",
      "mission3": "Front-End and Back-End design and development for web applications.",
      "mission4": "Development of essential features and custom modules",
      "mission5": "Implementation of unit tests.",
      "mission6": "Evolutionary and corrective maintenance.",
      "mission7": "Fast resolution of issues and bugs to maintain a flawless user experience.",
      "mission8": "Active participation in team meetings and project planning",
      "mission9": "Constant technological surveillance."
    }
  },
  "projectsSection": {
    "title": "projects",
    "description": "description",
    "tasks": "tasks",
    "techAndTools": "Technologies & tools",
    "learnMore": "Learn more",
    "portfolio": {
      "title": "Portfolio",
      "description": "Explore the essence of my fullstack development expertise through my portfolio. Dive into a carefully curated collection of projects that highlight my mastery of both front-end and back-end. Every line of code and every user interface are testaments to my commitment to technical excellence and functional creativity. Welcome to my digital world, where each project tells the story of my journey as a passionate full-stack developer.",
      "tasks": {
        "task1": "Design and development of the user interface using Vue.js, Vuetify, HTML, CSS and JavaScript to ensure a smooth and intuitive user experience.",
        "task2": "Creation of Vue.js components.",
        "task3": "Ensuring the internationalization of interfaces with Vue I18n."
      }
    },
    "hcub": {
      "title": "HCUB",
      "description": "I was mandated to participate in the development of an identity and access management (IAM) solution to help the company ensure that only users with appropriate authorizations can access information system resources using Laravel and Vue.js.",
      "tasks": {
        "task1": "Creation of the customized user dashboard with a UI/UX designer.",
        "task2": "Creation of reusable Vue.js components.",
        "task3": "Integration of mockups via Vue.js and Vuetify.",
        "task4": "Ensuring the internationalization of interfaces with Vue I18n.",
        "task5": "Evaluating scalability needs and implementing solutions.",
        "task6": "Creation and use of Rest APIs.",
        "task7": "Upgraded versions of Laravel (from 6 to 8) and PHP (from 5.6 to 8.1).",
        "task8": "Analysis and resolution of anomalies and bugs reported.",
        "task9": "Implementation of unit tests."
      }
    },
    "timesheets": {
      "title": "Timesheets",
      "description": "As a Laravel/Vue.js developer, I was responsible for designing and developing a working time management tool. It allows employees to record time spent on various tasks or projects and it allows employers to review and submit timesheets.",
      "tasks": {
        "task1": "Analysis of customer needs and writing of technical specifications.",
        "task2": "Integration of mockups via Vue.js and Bootstrap-Vue.",
        "task3": "Assurance of reactivity, good ergonomics and optimal navigation of the website.",
        "task4": "Design and development of front-end and back-end features.",
        "task5": "Creation and use of RESTful APIs.",
        "task6": "Development of user management modules, authorizations and permissions, scopes, invoices and profiles.",
        "task7": "Analysis and resolution of anomalies and bugs reported.",
        "task8": "Implementation of unit tests."
      }
    },
    "starkB2b": {
      "title": "Stark B2B",
      "description": "During this experience, I participated in the improvement phase of the existing solution as a full stack developer. My role was to identify gaps in the previous version of the system, propose solutions and implement significant improvements on both the front-end and back-end sides.",
      "tasks": {
        "task1": "Collaborate with the team to understand user needs and identify areas of critical improvement to the existing solution.",
        "task2": "Reviewed and optimized the existing user interface using modern technologies such as Vue.js and Vuetify, thereby improving the user experience.",
        "task3": "Integrate new features based on user feedback and business requirements.",
        "task4": "Perform back-end code refactorings to improve the maintainability, performance and scalability of the application.",
        "task5": "Collaborated with external services to integrate new features and improve workflows."
      }
    },
    "starkSolution": {
      "title": "Stark Solutions",
      "description": "As a Vue.js developer, I was responsible for designing and developing a platform allowing the creation of accounts, the management of organizations, customers, packs and sponsorship.",
      "tasks": {
        "task1": "User interface design and development using Vue.js, Bootstrap-vue, HTML, CSS and JavaScript to ensure a smooth and intuitive user experience.",
        "task2": "Assurance of reactivity, good ergonomics and optimal navigation of the website.",
        "task3": "Ensuring the internationalization of interfaces with Vue I18n.",
        "task4": "Implement a complete authentication system, including registration, login and password reset.",
        "task5": "Consumption of RESTful APIs.",
        "task6": "Development of modules for managing roles, customers and salespeople.",
        "task7": "Development of a sponsorship and promo code configuration modules.",
        "task8": "Collaborate closely with the team to understand business needs and requirements, as well as to make continuous improvements."
      }
    },
    "jobboard": {
      "title": "Job board",
      "description": "I designed and developed a complete Job Board that allows job seekers to search and apply for job offers, and recruiters to post offers and manage their recruitment processes.",
      "tasks": {
        "task1": "I designed and developed a complete Job Board that allows job seekers to search and apply for job offers, and recruiters to post offers and manage their recruitment processes.",
        "task2": "Implementation of the architecture to manage users, applications and job offers.",
        "task3": "Designed the responsive user interface using Angular.",
        "task4": "Design and development of front-end and back-end features.",
        "task5": "Creation and use of Rest APIs.",
        "task6": "Implementation of email notifications.",
        "task7": "Implementation of unit tests."
      }
    },
    "crmAjst": {
      "title": "Administration platform",
      "description": "As a Symfony developer and a member of the Tunisian Youth Science Association, I was responsible for designing, developing and maintaining a tailor-made administration platform intended to optimize the organization's internal processes.",
      "tasks": {
        "task1": "Analysis of needs and drafting of technical specifications.",
        "task2": "Design and implementation of a robust web application based on the Symfony framework, ensuring effective management of the Association's administrative activities.",
        "task3": "User interface design and development using Twig, Bootstrap, HTML, CSS and JavaScript to ensure a smooth and intuitive user experience.",
        "task4": "Implementation of the architecture to manage users, access, resources and events.",
        "task5": "Integration of modules such as membership management, event tracking, reporting and resource management, thereby contributing to transparent and collaborative management within the organization."
      }
    }
  },
  "referencesSection": {
    "title": "I'm proud to have collaborated with some awesome companies"
  },
  "footer": {
    "message": "Interested in working together? We should queue up a time to chat. I’ll buy the coffee."
  }
}